/*1. Να γραφεί πρόγραμμα που θα διαβάζει τους βαθμούς 10 φοιτητών, θα τους αποθηκεύει
σε έναν πίνακα και θα εμφανίζει τη μικρότερη και μεγαλύτερη βαθμολογία καθώς και τις
θέσεις τους στον πίνακα. Να γίνεται έλεγχος των βαθμών στα όρια 0…10. Η διαχείριση του
πίνακα να γίνει με σημειογραφία δείκτη.*/
/*#include<stdio.h>
int main(){
    int i,max_pos,min_pos;
    float arr[10],max,min;
    max=0;
    min=10;
    for(i=0; i<10; i++){
        printf("Dwse to %do stoixio tou pinaka: ", i+1);
        scanf("%f", arr+i);
    }
    for(i=0; i<10; i++){
        if(max<*(arr+i)){
            max=*(arr+i);
            max_pos=i+1;
        }
        if(min>*(arr+i)){
            min=*(arr+i);
            min_pos=i+1;
        }
    }
    printf("O megalyteros vathmos einai: %.1f kai einai sth thesi: %d\n", max,max_pos);
    printf("O mikroteros vathmos einai: %.1f kai einai sth thesi: %d\n", min,min_pos);
}*/

/*2. Να γραφεί πρόγραμμα που θα διαβάζει τις ημερήσιες θερμοκρασίες μιας πόλης για μία
εβδομάδα και θα τις αποθηκεύει σε έναν πίνακα. Στη συνέχεια θα διαβάζει μια
θερμοκρασία και θα εμφανίζει την πρώτη μέρα της εβδομάδας (με αριθμητική
αναπαράσταση, δηλαδή για τη Δευτέρα θα εμφανίζει τον αριθμό 1) που η θερμοκρασία
ήταν μικρότερη από αυτή. Η διαχείριση του πίνακα να γίνει με σημειογραφία δείκτη.
*/
/*#include <stdio.h>
int main(){
    float arr[7],input;
    int i,min_pos=0;
    for(i=0; i<7; i++){
        printf("Dwse th thermokrasia ths %dhs meras: ", i+1);
        scanf("%f", arr+i);
    }
    printf("Dwse mia thermokrasia: ");
    scanf("%f", &input);
    for(i=0; i<7; i++){
        if(*(arr+i)<input){
            min_pos=i+1;
            break;
        }
    }
    printf("H hmera me mikroterh thermokrasia apo auth pu edwses einai: %d\n", min_pos);
}*/

/*5. Να γραφεί πρόγραμμα που να δημιουργεί ένα διδιάστατο πίνακα ακεραίων 3x4. Τα
στοιχεία του θα δίνονται από το πληκτρολόγιο. Στη συνέχεια θα εμφανίζει την ελάχιστη και
τη μέγιστη τιμή κάθε γραμμής και κάθε στήλης. Εμφανίστε τον πίνακα στην αλγεβρική του
μορφή για την επιβεβαίωση των αποτελεσμάτων. Η διαχείριση του πίνακα να γίνει με
σημειογραφία δείκτη.
*/


/*6. Να γράψετε πρόγραμμα που να δημιουργεί ένα μονοδιάστατο πίνακα 10 θέσεων με
ακεραίους. Στη συνέχεια να διαβάζει 10 τιμές, να τις αποθηκεύει στον πίνακα και, τέλος,
να τις εμφανίζει με αντίστροφη σειρά από αυτή που εισήχθησαν. Η διαχείριση του πίνακα
να γίνει με σημειογραφία δείκτη.*/
/*#include <stdio.h>
int main(){
    int arr[10],i;
    for(i=0; i<10; i++){
        printf("Dwse to %do arithmo: ", i+1);
        scanf("%d",arr+i);
    }
    for(i=9; i>-1; i--){
        printf("%d\n",*(arr+i));
    }
}*/

/*7. Να γράψετε πρόγραμμα που να δημιουργεί ένα μονοδιάστατο πίνακα 8 θέσεων με
ακεραίους. Στη συνέχεια να διαβάζει 8 τιμές και να τις αποθηκεύει στον πίνακα. Έπειτα να
εμφανίζει το γινόμενο κάθε θέσης του πίνακα με το περιεχόμενο της θέσης, δηλαδή για τη
θέση 3 αν το περιεχόμενο είναι 5 θα πρέπει να εμφανίσει 15. Η διαχείριση του πίνακα να
γίνει με σημειογραφία δείκτη.
*/
/*#include <stdio.h>
int main(){
    int arr[8],i;
    for(i=0; i<8; i++){
        printf("Dwse ton %do aritmo: ", i+1);
        scanf("%d", arr+i);
    }
    for(i=0; i<8; i++){
        printf("%d x %d = %d\n", i+1,*(arr+i),(i+1)**(arr+i));
    }
}*/
