/*1. Δημιουργήστε μια αναδρομική συνάρτηση που να δέχεται σαν παράμετρο έναν ακέραιο
αριθμό n και να επιστρέφει το παραγοντικό του, χρησιμοποιώντας τον τύπο n! = n * (n-1)!.
Το παραγοντικό ενός ακέραιου n, όπου n ≥ 1, είναι το γινόμενο των ακέραιων από το 1
μέχρι και το n (1 * 2 * 3 * 4 * … * n). Το παραγοντικό του 0 είναι ίσο με 1 (0! = 1).
Να γραφεί ένα πρόγραμμα το οποίο θα διαβάζει έναν θετικό ακέραιο, μικρότερο από 170
και θα εμφανίζει το παραγοντικό του με χρήση της συνάρτησης.*/
/*#include <stdio.h>

double factorial(int n){
    if(n==0){
        return 1;
    }
    if(n==1){
        return 1;
    }
    return n*factorial(n-1);
}

int main(){
    int x;

    do {
        printf("Dwse enan akeraio(0-170): ");
        scanf("%d", &x);
    } while (x < 0 || x > 170);
    
    printf("To factorial tou |%d| einai: %.0lf", x, factorial(x));
}*/


/*2. Να γραφεί πρόγραμμα που θα ζητά από το χρήστη να δώσει έναν ακέραιο αριθμό n,
μεγαλύτερο του 0, και θα υπολογίζει το άθροισμα της σειράς:
1/1 + 1/2 + 1/3 + 1/4 + … + 1/n*/
/*#include <stdio.h>

float sum(int n){
    if(n==1){
        return 1;
    }

    return 1.0/n + sum(n-1);
}

int main(){
    int x;

    do {
        printf("Dwse enan akereo megalytero apo to 0: ");
        scanf("%d", &x);
    } while (x<=0);

    printf("O arithmos pu edwses einai o |%d| kai to apotelesma einai: %.5f", x, sum(x));
}*/


/*3. Να γράψετε πρόγραμμα που να υπολογίζει τον Μέγιστο Κοινό Διαιρέτη δύο ακέραιων
αριθμών με τη μέθοδο του Ευκλείδη η οποία εκφράζεται ως εξής: Ο ΜΚΔ δύο αριθμών α
και β είναι ο ίδιος με τον ΜΚΔ του β και του υπολοίπου της διαίρεσης α με β.
ΜΚΔ(α,β)= { 𝛭𝛫𝛥(𝛽, 𝛼 𝑚𝑜𝑑 𝛽), 𝛼𝜈 𝛽 ≠ 0 ή
𝛼, 𝛼𝜈 𝛽 = 0 }
Για την υλοποίηση να χρησιμοποιήσετε αναδρομική συνάρτηση η οποία περιγράφεται ως
εξής: Αν ο β είναι 0 τότε ο ΜΚΔ είναι ο α. Αν β≠0, καλούμε αναδρομικά τη συνάρτηση με
παραμέτρους το β και το υπόλοιπο της διαίρεσης του α με το β. Η διαδικασία
επαναλαμβάνεται μέχρι να φθάσουμε στο σημείο όπου το δεύτερο όρισμα της
συνάρτησης είναι μηδέν, οπότε επιστρέφουμε τον πρώτο αριθμό ως αποτέλεσμα.*/
/*#include <stdio.h>

int mkd(int a, int b){
    if(b==0){
        return a;
    }
    return mkd(b, a%b);
}

int main(){
    int x,y;

    printf("Dhlwse 2 akereous arithmous: ");
    scanf("%d %d", &x, &y);

    printf("O MKD tou |%d| kai |%d| einai: %d", x, y, mkd(x,y));
}*/